ParkerSD/FlashBlaster/nRF5_SDK_16.0.0_98a08e2/examples/ble_peripheral/ble_app_uart/pca10056/s140/ses/system.c
        //create first chip
        uint32_t chip_addr0 = *chip_list_buffer << 24 | *(chip_list_buffer + 1) << 16 | *(chip_list_buffer + 2) << 8 | *(chip_list_buffer + 3);
        char* chip_buffer = malloc(sizeof(char[CHIP_HEADER_SIZE]));  //TODO FREE
        flash_read(chip_buffer, chip_addr0, CHIP_HEADER_SIZE);
        project_selected->chip_first = chip_new(chip_buffer, project_selected); // create first project(head of list) 

        // create remainder of projects, first proejct already made 
        for(int i = 0; i < total_chips; i++) 
        {   
            // convert 4 bytes into 32bit number 
            uint32_t chip_addr = *(chip_list_buffer + (i*4)) << 24 | *(chip_list_buffer + 1 + (i*4)) << 16 | *(chip_list_buffer + 2 + (i*4)) << 8 | *(chip_list_buffer + 3 + (i*4));
            flash_read(chip_buffer, chip_addr, CHIP_HEADER_SIZE);// read project data 
            chip_new(chip_buffer, project_selected);
        }

        free(chip_list_buffer);
        free(chip_buffer);
    }
    else
    {
        project_selected->chip_first = chip_create(); 
        project_selected->chip_first->file_first = file_create();
    }
}


chip_struct* chip_list_index(int index, project_struct* project_curr) 
{ 
    chip_struct* chipN;
    chipN = project_curr->chip_first; 

    for(int i = 1; i < index; i++) // minus 1 loop since file_first was already factored in
    {
        chipN = chipN->chip_next; 
    }
    return chipN; 
}

chip_struct* chip_new(char* data, project_struct* project_curr)
{  
    chip_struct* chipY = chip_create(); 
    chipY->chip_name = name_fetch(data);
    chipY->chip_type_id = *(data+16) << 24 | *(data+17) << 16 | *(data+18) << 8 | *(data+19);
    chipY->file_num = *(data+20) << 24 | *(data+21) << 16 | *(data+22) << 8 | *(data+23); 
    chipY->project_parent = project_curr; 

    chipY->file_first = NULL;
    chipY->chip_next = NULL;
    
    chipY->file_list_addr = DIRECTORY_OFFSET + PROJECT_SECTOR_OFFSET + CHIP_HEADER_SIZE + (project_curr->chip_curr * MAX_CHIP_SIZE);

    if(project_curr->chip_curr != 0) //push node, add to project_next
    {  
        int olderSiblingIndex = (project_curr->chip_curr - 1);  
        chip_struct* chipZ = chip_list_index(olderSiblingIndex, project_curr);    //index olderSibling and assign project to project_next node of last created project, older sibling is at index of SYS_ project_num
        chipZ->chip_next = chipY;  
    }

    chipY->chip_index = project_curr->chip_curr; // NOTE: POSSIBLE BUG HERE, should index from zero
    project_curr->chip_curr += 1; 

    return chipY; 
}


void projects_sync(void) //sync projects from flash
{
    //determine number of projects from directory value
    uint8_t* num_projects = malloc(sizeof(int)); 
    flash_read(num_projects, ADDR_NUM_PROJECTS, WORD_SIZE); // read num projects // flash_read(uint8_t* buffer_rx, uint32_t start_addr, size_t DATA_SIZE_BYTES)
    uint32_t project_count = bytes_to_word(num_projects, project_count); // function to convert byte array to 32bit word 
    SYS_ projects_total = project_count; // populate system struct with project num value from flash
    free(num_projects);

    if(project_count != 0)
    {   
        // buffer all project pointers 
        uint32_t total_projects_length = project_count * WORD_SIZE; 
        uint8_t project_addr[total_projects_length]; // array sized for all project addresses 
        flash_read(project_addr, ADDR_PROJECT_PTR_FIRST, total_projects_length); // buffer for all project addresses
        
        // create first project in RAM, extract to function
        char* project_buffer = malloc(sizeof(char[PROJECT_HEADER_SIZE])); // name string plus num_chips malloc 
        uint32_t current_addr = project_addr[0] << 24 | project_addr[1] << 16 | project_addr[2] << 8 | project_addr[3]; // shift bytes into 32bit int
        flash_read(project_buffer, current_addr, PROJECT_HEADER_SIZE);
        SYS_ project_first = project_new(project_buffer); // create first project(head of list) 

        // create remainder of projects, first project already made 
        for(int i = 0; i < project_count; i++) 
        {   
            // convert 4 bytes into 32bit number 
            current_addr = project_addr[0 + (i*4)]  << 24 | project_addr[1 + (i*4)] << 16 | project_addr[2 + (i*4)] << 8 | project_addr[3 + (i*4)];
            flash_read(project_buffer, current_addr, PROJECT_HEADER_SIZE);// read project data 
            project_new(project_buffer);
        }
        free(project_buffer);
    }
    else
    {
        SYS_ project_first = project_create(); // create empty project - chip - file structures
        SYS_ project_first->chip_first = chip_create();
        SYS_ project_first->chip_first->file_first = file_create();
    }
}


project_struct* project_list_index(int index) 
{ 
    project_struct* projectN;
    projectN = SYS_ project_first; 

    for(int i = 1; i < index; i++) // minus 1 loop since file_first was already factored in
    {
        projectN = projectN->project_next; 
    }
    return projectN; 
}


project_struct* project_new(char* data) //input 24 byte project data, string, num_chips, and chip_first address
{
    project_struct* projectY = project_create(); //create project
    projectY->project_name = name_fetch(data);  // send in payload, fetch from flash
    projectY->chip_num = *(data+16) << 24 | *(data+17) << 16 | *(data+18) << 8 | *(data+19);//TODO: chip_num_fetch(data) - last 4 bytes of 20 bytes;
    projectY->project_next = NULL;
    projectY->chip_first = NULL; 
    projectY->chip_list_addr = DIRECTORY_OFFSET + PROJECT_HEADER_SIZE + (SYS_ project_curr * MAX_PROJECT_SIZE); //was *(data+20) << 24 | *(data+21) << 16 | *(data+22) << 8 | *(data+23);// NOTE MAKE ACTUAL FLASH ADDRESS OF FIRST CHIP BASED ON MAX PROJECT LENGTH 
    projectY->chip_curr = 0;

    if(SYS_ project_curr != 0) //push node, add to project_next
    {  
        int olderSiblingIndex = (SYS_ project_curr - 1);  
        project_struct* projectZ = project_list_index(olderSiblingIndex);    //index olderSibling and assign project to project_next node of last created project, older sibling is at index of SYS_ project_num
        projectZ->project_next = projectY;  
    }
  
    projectY->project_index = SYS_ project_curr; // NOTE: POSSIBLE BUG HERE, should index from zero
    SYS_ project_curr += 1; 

    return projectY; //should return newly created to global
}

void flash_init(void)
{   
    // ADDR_NUM_PROJECTS 0
    // ADDR_PROJECT_PTR_FIRST 4

    // init flash for test below 
    flash_erase(0, NRF_QSPI_ERASE_LEN_4KB); // erase all 

