ParkerSD/FlashBlaster/nRF5_SDK_16.0.0_98a08e2/examples/ble_peripheral/ble_app_uart/pca10056/s140/ses/system.c
    //DIRECTORY                                                           //288
    uint8_t directory[32] = {0, 0, 0, 3, 0, 0, 0, 32, 0, 0, 0, 160, 0, 0, 1, 32, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0}; // num projects: 1, first project address: 32
    flash_write(directory, 0, 32); // write test directory

    //NOTE PROJECT 1 - 24 bytes (including first chip addr) 
    uint8_t project_string_test0[] = {"project0"}; //long form, single write {'p', 'r', 'o', 'j', 'e', 'c', 't', '0', 0, 0, 0, 1, 0, 0, 2, 0}; 
    uint8_t chip_num_test[WORD_SIZE] = {0, 0, 0, 3};
    uint8_t chip_ptr_first_test[WORD_SIZE] = {0, 0, 2, 0}; //address 512 when bit shifted
    uint8_t chip_ptr_sec_test[WORD_SIZE] = {0, 0, 2, 128}; //address 640 when bit shifted
    uint8_t chip_ptr_three_test[WORD_SIZE] = {0, 0, 3, 0}; //address 768 when bit shifted
    flash_write(project_string_test0, 32, MAX_STRING_SIZE); // name sting 16 bytes long 
    flash_write(chip_num_test, 48, WORD_SIZE); // chip num 4 bytes, address 48 (after string) 
    flash_write(chip_ptr_first_test, 52, WORD_SIZE); // write first chip ptr after chip_num value of first project
    flash_write(chip_ptr_sec_test, 56, WORD_SIZE);
    flash_write(chip_ptr_three_test, 60, WORD_SIZE);
    //CHIP 0 - 28 bytes (including first file addr) 
    uint8_t chip_string_test0[] = {"chip0"}; //16 bytes
    uint8_t chip_type_ID[WORD_SIZE] = {0, 0, 7, 0}; 
    uint8_t files_num[WORD_SIZE] = {0, 0, 0, 3}; 
    uint8_t files_first_addr[WORD_SIZE] = {0, 0, 3, 128}; // 896
    uint8_t files_sec_addr[WORD_SIZE] = {0, 0, 3, 156}; // 924
    uint8_t files_third_addr[WORD_SIZE] = {0, 0, 3, 184}; // 952 
    flash_write(chip_string_test0, 512, MAX_STRING_SIZE);
    flash_write(chip_type_ID, 528, WORD_SIZE);
    flash_write(files_num, 532, WORD_SIZE);
    flash_write(files_first_addr, 536, WORD_SIZE);
    flash_write(files_sec_addr, 540, WORD_SIZE);
    flash_write(files_third_addr, 544, WORD_SIZE);
    //FILE0
    uint8_t file_string_test0[] = {"file0"}; //16 bytes
    uint8_t timestamp0[WORD_SIZE] = {0, 0, 0, 1}; 
    uint8_t datalength0[WORD_SIZE] = {0, 0, 0, 1}; 
    uint8_t dataaddress0[WORD_SIZE] = {0, 0, 0, 1}; 
    flash_write(file_string_test0, 896, MAX_STRING_SIZE);
    flash_write(timestamp0, 912, WORD_SIZE);
    flash_write(datalength0, 916, WORD_SIZE);
    flash_write(dataaddress0, 920, WORD_SIZE);
    //FILE1
    uint8_t file_string_test1[] = {"file1"}; //16 bytes
    uint8_t timestamp1[WORD_SIZE] = {0, 0, 0, 1}; 
    uint8_t datalength1[WORD_SIZE] = {0, 0, 0, 1}; 
    uint8_t dataaddress1[WORD_SIZE] = {0, 0, 0, 1}; 
    flash_write(file_string_test1, 924, MAX_STRING_SIZE);
    flash_write(timestamp1, 940, WORD_SIZE);
    flash_write(datalength1, 944, WORD_SIZE);
    flash_write(dataaddress1, 948, WORD_SIZE);
    //FILE2
    uint8_t file_string_test2[] = {"file2"}; //16 bytes
    uint8_t timestamp2[WORD_SIZE] = {0, 0, 0, 1}; 
    uint8_t datalength2[WORD_SIZE] = {0, 0, 0, 1}; 
    uint8_t dataaddress2[WORD_SIZE] = {0, 0, 0, 1}; 
    flash_write(file_string_test2, 952, MAX_STRING_SIZE);
    flash_write(timestamp2, 968, WORD_SIZE);
    flash_write(datalength2, 972, WORD_SIZE);
    flash_write(dataaddress2, 976, WORD_SIZE);

    //CHIP 1
    uint8_t chip_string_test1[] = {"chip1"}; //16 bytes
    uint8_t chip_type_ID1[WORD_SIZE] = {0, 0, 7, 0}; 
    uint8_t files_num1[WORD_SIZE] = {0, 0, 7, 0}; 
    uint8_t files_first_addr1[WORD_SIZE] = {0, 0, 255, 255}; 
    flash_write(chip_string_test1, 640, MAX_STRING_SIZE);
    flash_write(chip_type_ID1, 656, WORD_SIZE);
    flash_write(files_num1, 660, WORD_SIZE);
    flash_write(files_first_addr1, 664, WORD_SIZE);
    //CHIP 2
    uint8_t chip_string_test2[] = {"chip2"}; //16 bytes
    uint8_t chip_type_ID2[WORD_SIZE] = {0, 0, 7, 0}; 
    uint8_t files_num2[WORD_SIZE] = {0, 0, 7, 0}; 
    uint8_t files_first_addr2[WORD_SIZE] = {0, 0, 255, 255}; 
    flash_write(chip_string_test2, 768, MAX_STRING_SIZE);
    flash_write(chip_type_ID2, 784, WORD_SIZE);
    flash_write(files_num2, 788, WORD_SIZE);
    flash_write(files_first_addr2, 792, WORD_SIZE);
    
    //NOTE PROJECT 2
    uint8_t project_string_test1[] = {"project1"};
    uint8_t chip_num_test1[WORD_SIZE] = {0, 0, 0, 0};
    flash_write(project_string_test1, 160, MAX_STRING_SIZE); // name string 16 bytes long 
    flash_write(chip_num_test1, 176, WORD_SIZE);
    
    //NOTE PROJECT 3 
    uint8_t project_string_test2[] = {"project2"};
    uint8_t chip_num_test2[WORD_SIZE] = {0, 0, 0, 0};
    flash_write(project_string_test2, 288, MAX_STRING_SIZE); // name string 16 bytes long 
    flash_write(chip_num_test2, 304, WORD_SIZE);
    
}


void system_init(void) // create global system struct and read directory info from flash, create project structs 
{   
    system_singleton = system_new();  
    flash_init(); 
    projects_sync(); 
}


char* firmware_version_fetch(void)
{
    //fetch FW version from flash 
    return systemFirmware;
}


char* name_fetch(char* data)
{
    char* name_string = malloc(sizeof(char[MAX_STRING_SIZE])); //TODO FREE 
    memcpy(name_string, data, MAX_STRING_SIZE); //16 bytes = max string length 
    return name_string;
}


chip_struct* chip_parent_fetch(void)
{
    // TODO: fetch chip_parent member from newly create file
    // read external flash here
    return NULL;
}


project_struct* project_parent_fetch(void)
{
    // TODO: fetch project_parent member from newly created chip
    // read external flash here
    return NULL; 
}


//TODO: create file_new, project_new, chip_new functions for adding nodes, add menu item to allow creation, at bottom of menu?
file_struct* file_list_index(file_struct* file, int index) 
{ 
    file_struct* fileN;
    fileN = file->chip_parent->file_first; 

    for(int i = 1; i < index; i++) // minus 1 loop since file_first was already factored in
    {
        fileN = fileN->file_next; 
    }
    return fileN; 
}


file_struct* file_new(void) //fetches file from Flash and adds to linked list in RAM 
{   
    file_struct* fileY = file_create(); //create file
    
    fileY->chip_parent = chip_parent_fetch(); // data needs to be sent in payload and fetched from flash
    fileY->file_name = NULL;//name_fetch();  // send in payload, fetch from flash
    fileY->file_next = NULL;
    fileY->file_data = NULL; // send in payload, pointer to data in flash 
    
    fileY->file_index = fileY->chip_parent->file_num; // update file index
    fileY->chip_parent->file_num += 1; //increment file counter on chip_parent
    

    if(fileY->file_index != 0) //push node, add to file_next of last file
    {   
        int olderSiblingIndex = fileY->file_index - 1;  // older sibling is one made previously
        file_struct* fileZ = file_list_index(fileY, olderSiblingIndex); 
        fileZ->file_next = fileY; //assign newly created file as file_next of last file
    }

